app/controllers/articles_controller.rb

  def index
    @articles = Article.where(user_id: current_user.id)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = 2 LIMIT 1

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "sdfdsfds"], ["created_at", "2014-11-26 14:47:32.915431"], ["title", "sdsdf"], ["updated_at", "2014-11-26 14:47:32.915431"], ["user_id", 1]]

  def update
    @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = 4  [["updated_at", "2014-12-09 15:43:51.052570"]]

  def moderate
    if @article.is_moderated?
      update_param = false
    else
      update_param = true
    end
    @article.update_attribute(:is_moderated, update_param)
---
UPDATE "articles" SET "is_moderated" = ?, "updated_at" = ? WHERE "articles"."id" = 4  [["is_moderated", "t"], ["updated_at", "2014-12-09 12:25:38.710145"]]