app/controllers/index_controller.rb

  def index
    @articles = Article.where(:is_moderated => 't')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."is_moderated" = 't'

  def admin_articles_moderation
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def admin_users
    @users = User.where(:admin => 'f')
---
SELECT "users".* FROM "users"  WHERE "users"."admin" = 'f'