app/controllers/persons_controller.rb

  def admin_set_moderator
    if current_user.admin?
      user = User.find(params[:id])
      user.update_attribute(:moderator, true)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "moderator" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["moderator", "t"], ["updated_at", "2014-12-09 09:59:10.446605"]]